## **Working with dataset**

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_excel('./data.xlsx')

# print(df)

In [ ]:
df.sort_index(ascending=False)

In [ ]:
dataframe = {"A col": 1, "B col": [2, 3, 4], "C col": "test"}
data = pd.DataFrame(dataframe)
data.head()

In [ ]:
import numpy as np

data = pd.DataFrame(np.random.randn(4, 6),columns=list("ABCDEF"))
data.head()

In [ ]:
data.rename(columns={"A": "A col", "B": "B col", "C": "C col"}, inplace=True)
data

In [ ]:
data.columns = data.columns.str.replace(" ", "_")
data

In [ ]:
data = data.add_prefix("prefix_")
data

In [ ]:
import pandas as pd
import numpy as np
import seaborn as sns

tips = sns.load_dataset("tips")
tips.columns
tips.to_csv("tips.csv", index=False)
tips.head(-3)

In [ ]:
tips.loc[::-1].reset_index(drop=True).head()

In [ ]:
tips.loc[:, ::-1].head()

In [ ]:
tips.loc[:, ::-1].reset_index(drop=True).head()

In [ ]:
tips.dtypes

In [ ]:
tips.select_dtypes(include=["category", "number"]).head()

In [ ]:
db = sns.load_dataset("titanic")
db.shape

In [ ]:
db.sample(frac=0.5).shape
db.info()

In [ ]:
cb = pd.read_clipboard()
cb

In [ ]:
db.sex.unique()

In [ ]:
isFemale = (db.sex == "female")
db[isFemale]
female_df = db.query("sex == 'female'")
female_df

In [ ]:
condition =  ((db.embark_town == "Southampton") |  (db.embark_town == "Queenstown")) & (db.sex == "female") 
db[condition]

In [22]:
# Binning of age column into 7 categories
bins = [0, 2, 12, 18, 30, 45, 60, 100]
labels = ["Infant", "Child", "Teenager", "Young Adult", "Adult", "Middle Aged", "Senior"]

db["age"].fillna(0, inplace=True)  # Fill NaN values with 0 for binning
db["age"] = db["age"].astype(int)  # Ensure age is an integer


cut = pd.cut(db["age"], bins=bins, labels=labels, include_lowest=True)
db["age_group"] = cut

C:\Users\abdul\AppData\Local\Temp\ipykernel_29056\2413223410.py:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  db["age"].fillna(0, inplace=True)  # Fill NaN values with 0 for binning

In [23]:
db.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_group
0,0,3,male,22,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,Young Adult
1,1,1,female,38,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,Adult
2,1,3,female,26,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,Young Adult
3,1,1,female,35,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,Adult
4,0,3,male,35,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,Adult

In [25]:
db["age_group"].value_counts()

age_group
Young Adult    272
Adult          202
Infant         201
Middle Aged     79
Teenager        70
Child           45
Senior          22
Name: count, dtype: int64

In [26]:
db.rename(columns={"age_group": "age_category"}, inplace=True)

In [27]:
db.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_category
0,0,3,male,22,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,Young Adult
1,1,1,female,38,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,Adult
2,1,3,female,26,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,Young Adult
3,1,1,female,35,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,Adult
4,0,3,male,35,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,Adult

In [37]:
# grouping by age category and calculating survival rate in percentage %
age_grouped = db.groupby("age_category")["survived"].mean() * 100
age_grouped = age_grouped.reset_index()
age_grouped

C:\Users\abdul\AppData\Local\Temp\ipykernel_29056\2218596275.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  age_grouped = db.groupby("age_category")["survived"].mean() * 100

  age_category   survived
0       Infant  33.333333
1        Child  55.555556
2     Teenager  42.857143
3  Young Adult  35.294118
4        Adult  42.574257
5  Middle Aged  41.772152
6       Senior  22.727273

In [39]:
db['class'].value_counts()

class
Third     491
First     216
Second    184
Name: count, dtype: int64

In [43]:
db[db["class"] == "First"]["survived"].mean() * 100

np.float64(62.96296296296296)

In [ ]:
# find all good statistics from the dataset
good_stats = db.describe(include="all")
good_stats
# Save the good statistics to a CSV file
good_stats.to_csv("titanic_statistics.csv")